a-pemberton/ESP32-S3-Pico_Nixie_Clock/ESP32-S3_Nixie_Clock/GUI_Paint.cpp

/*****************************************************************************
* | File        :   GUI_Paint.C
* | Function    :   test Demo
* | Info        :
*----------------
* |	This version:   V1.0
* | Date        :   2021-03-16
* | Info        :   
#
# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documnetation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to  whom the Software is
# furished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be included in
# all copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS OR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
# THE SOFTWARE.
#
******************************************************************************/

#include "ESP32_Nixie.h"

//---------------------------------------------------------------------------------
// LCD Paint Prototypes
//---------------------------------------------------------------------------------

//init and Clear
void Paint_NewImage(uint8_t *, uint16_t, uint16_t, uint16_t, uint16_t);
void Paint_SelectImage(uint8_t *);
void Paint_SetRotate(uint16_t);
void Paint_SetMirroring(uint8_t);
void Paint_SetPixel(uint16_t, uint16_t, uint16_t);
bool Paint_SetScale(uint8_t);

bool Paint_Clear(uint16_t);
void Paint_ClearWindows(uint16_t, uint16_t, uint16_t, uint16_t, uint16_t);

//Drawing
void Paint_DrawPoint(uint16_t, uint16_t, uint16_t, DOT_PIXEL, DOT_STYLE);
void Paint_DrawLine(uint16_t, uint16_t, uint16_t, uint16_t, uint16_t, DOT_PIXEL, LINE_STYLE);
void Paint_DrawRectangle(uint16_t, uint16_t, uint16_t, uint16_t, uint16_t, DOT_PIXEL, DRAW_FILL);
void Paint_DrawCircle(uint16_t, uint16_t, uint16_t, uint16_t, DOT_PIXEL, DRAW_FILL);

//Display string
void Paint_DrawChar(uint16_t, uint16_t, const char, sFONT*, uint16_t, uint16_t);
void Paint_DrawString_EN(uint16_t, uint16_t, const char *, sFONT*, uint16_t, uint16_t);
void Paint_DrawString_CN(uint16_t, uint16_t, const char *, cFONT*, uint16_t, uint16_t);
void Paint_DrawNum(uint16_t, uint16_t, double, sFONT*, uint16_t,uint16_t, uint16_t);
void Paint_DrawTime(uint16_t, uint16_t, PAINT_TIME *, sFONT*, uint16_t, uint16_t);

//pic
void Paint_DrawBitMap(const unsigned char*);
void Paint_DrawBitMap_Block(const unsigned char*, uint8_t);

void Paint_DrawImage(const unsigned char *, uint16_t, uint16_t, uint16_t, uint16_t) ;
void Paint_DrawImage_16bit(const uint16_t *, uint16_t, uint16_t, uint16_t, uint16_t); 
void Paint_DrawImage1(const unsigned char *, uint16_t, uint16_t, uint16_t, uint16_t);

void Paint_BmpWindows(unsigned char,unsigned char,const unsigned char *,	unsigned char,unsigned char);

// Image attributes
typedef struct {
  uint8_t *Image;
  uint16_t Width;
  uint16_t Height;
  uint16_t WidthMemory;
  uint16_t HeightMemory;
  uint16_t Color;
  uint16_t Rotate;
  uint16_t Mirror;
  uint16_t WidthByte;
  uint16_t HeightByte;
  uint16_t Scale;
} PAINT;
PAINT Paint;


/******************************************************************************
function: Create Image
parameter:
    image   :   Pointer to the image cache
    width   :   The width of the picture
    Height  :   The height of the picture
    Color   :   Whether the picture is inverted
******************************************************************************/
void Paint_NewImage(uint8_t *image, uint16_t Width, uint16_t Height, uint16_t Rotate, uint16_t Color)
{
#ifdef DEBUG_GUI
    Serial.printf("Paint_NewImage(*image = 0x%X, Width = %i, Height = %i, Rotate = %i, Color = 0x%x)\n", image, Width, Height, Rotate, Color);
#endif

  Paint.Image = NULL;
  Paint.Image = image;  // Sets address of BlackImage

  Paint.WidthMemory = Width;
  Paint.HeightMemory = Height;
  Paint.Color = Color;    
	Paint.Scale = 2;
		
  Paint.WidthByte = (Width % 8 == 0) ? (Width / 8 ) : (Width / 8 + 1);
  Paint.HeightByte = Height;    
//    Serial.println("WidthByte = %d, HeightByte = %d\r\n", Paint.WidthByte, Paint.HeightByte);
//    Serial.println(" EPD_WIDTH / 8 = %d\r\n",  122 / 8);
   
  Paint.Rotate = Rotate;
  Paint.Mirror = MIRROR_NONE;
    
  if(Rotate == ROTATE_0 || Rotate == ROTATE_180) 
  {
    Paint.Width = Width;
    Paint.Height = Height;
  } else {
    Paint.Width = Height;
    Paint.Height = Width;
  }
#ifdef DEBUG_GUI
    Serial.printf("Paint.Image = 0x%X, Paint.WidthMemory = %i, Paint.HeightMemory = %i, Paint.Rotate = %i, Paint.Color = %i, Paint.WidthByte = %i, Paint.HeightByte = %i, Paint.Mirror = %i, Paint.Width = %i, Paint.Height = %i \n", Paint.Image, Paint.WidthMemory, Paint.HeightMemory, Paint.Rotate, Paint.Color, Paint.WidthByte, Paint.HeightByte, Paint.Mirror, Paint.Width, Paint.Height);
#endif
}

/******************************************************************************
function: Select Image
parameter:
    image : Pointer to the image cache
******************************************************************************/
void Paint_SelectImage(uint8_t *image)
{
  Paint.Image = image;
}

/******************************************************************************
function: Select Image Rotate
parameter:
    Rotate : 0,90,180,270
******************************************************************************/
void Paint_SetRotate(uint16_t Rotate)
{
  if(Rotate == ROTATE_0 || Rotate == ROTATE_90 || Rotate == ROTATE_180 || Rotate == ROTATE_270) {
#ifdef DEBUG_GUI
    Serial.printf("Set image Rotate %d\n", Rotate);
#endif
    Paint.Rotate = Rotate;
  } else {
#ifdef DEBUG_GUI
    Serial.printf("rotate = 0, 90, 180, 270 Only\n");
#endif
  }
}

//---------------------------------------------------------------------------------
// Routine to set LCD's scaling parameters at startup - Overrides default scale value 2
//---------------------------------------------------------------------------------

bool Paint_SetScale(uint8_t scale)
{

  Paint.Scale = scale;

  switch (Paint.Scale) {
    case 2: // for 8 pixels per 
      Paint.WidthByte = (Paint.WidthMemory % 8 == 0) ? (Paint.WidthMemory / 8) : (Paint.WidthMemory / 8 + 1);
      break;

    case 4:
      Paint.WidthByte = (Paint.WidthMemory % 4 == 0) ? (Paint.WidthMemory / 4) : (Paint.WidthMemory / 4 + 1);
      break;

