a-pemberton/ESP32-S3-Pico_Nixie_Clock/ESP32-S3_Nixie_Clock/GUI_Paint.cpp
    case 16:
      Paint.WidthByte = (Paint.WidthMemory % 2 == 0) ? (Paint.WidthMemory / 2) : (Paint.WidthMemory / 2 + 1);
      break;

    case 65: // 2 octets per pixel
      Paint.WidthByte = Paint.WidthMemory * 2;
      break;

    default:      
#ifdef DEBUG_GUI
      Serial.printf("Set Scale Input parameter error\n");
      Serial.printf("Scale Only support: 2 4 16 65\n");
#endif
      return true; // Flag failure
  }
#ifdef DEBUG_GUI
      Serial.printf("Paint.Scale is %i, Paint.WidthMemory is %i, Paint.WidthByte is %i\n",Paint.Scale, Paint.WidthMemory, Paint.WidthByte);
#endif

  return false;
}

/******************************************************************************
function:	Select Image mirror
parameter:
    mirror   :Not mirror,Horizontal mirror,Vertical mirror,Origin mirror
******************************************************************************/
void Paint_SetMirroring(uint8_t mirror)
{
  if (mirror == MIRROR_NONE || mirror == MIRROR_HORIZONTAL || mirror == MIRROR_VERTICAL || mirror == MIRROR_ORIGIN)
  {
#ifdef DEBUG_GUI
    Serial.printf("mirror image x:%s, y:%s\n",(mirror & 0x01)? "mirror":"none", ((mirror >> 1) & 0x01)? "mirror":"none");
#endif
    Paint.Mirror = mirror;
  } else {
#ifdef DEBUG_GUI
    Serial.printf("mirror should be MIRROR_NONE, MIRROR_HORIZONTAL, MIRROR_VERTICAL or MIRROR_ORIGIN\n");
#endif
  }    
}
    
/******************************************************************************
function: Draw Pixels
parameter:
    Xpoint : At point X
    Ypoint : At point Y
    Color  : Painted colors
******************************************************************************/
void Paint_SetPixel(uint16_t Xpoint, uint16_t Ypoint, uint16_t Color)
{
  if (Xpoint > Paint.Width || Ypoint > Paint.Height) {
#ifdef DEBUG_GUI
    Serial.printf("Exceeding display boundaries #1: Xpoint = %d, Paint.Width = %d, Ypoint = %d, Paint.Height = %d\n", Xpoint, Paint.Width, Ypoint, Paint.Height);
#endif
    return;
  }
  uint16_t X, Y = 0;
  uint32_t Addr = 0;
  uint8_t Rdata = 0;

  switch (Paint.Rotate) {
    case 0:
      X = Xpoint;
      Y = Ypoint;
      break;

    case 90:
      X = (Paint.WidthMemory - 1) - Ypoint;
      Y = Xpoint;
      break;

    case 180:
      X = (Paint.WidthMemory - 1) - Xpoint;
      Y = (Paint.HeightMemory - 1) - Ypoint;
      break;

    case 270:
      X = Ypoint;
      Y = (Paint.HeightMemory - 1) - Xpoint;
      break;

    default:
        return;
  }

#ifdef DEBUG_GUI
//  if (X > Paint.WidthMemory || Y > Paint.HeightMemory) {
//    Serial.printf("Exceeding display boundaries #2: Xpoint = %d, X = %d, Paint.WidthMemory = %d, Ypoint = %d, Y = %d, Paint.HeightMemory = %d\n", Xpoint, X, Paint.WidthMemory, Ypoint, Y, Paint.HeightMemory);
//  }
#endif
  switch (Paint.Mirror) {
    case MIRROR_NONE:
      break;
  
    case MIRROR_HORIZONTAL:
      X = Paint.WidthMemory - X - 1;
        break;
    
    case MIRROR_VERTICAL:
      Y = Paint.HeightMemory - Y - 1;
      break;

    case MIRROR_ORIGIN:
        X = Paint.WidthMemory - X - 1;
        Y = Paint.HeightMemory - Y - 1;
        break;

    default:
        return;
  }

  if (X > Paint.WidthMemory || Y > Paint.HeightMemory) {
#ifdef DEBUG_GUI
//    Serial.printf("Exceeding display boundaries #3: X = %d, Paint.WidthMemory = %d, Y = %d, Paint.HeightMemory = %d\n", X, Paint.WidthMemory, Y, Paint.HeightMemory);
#endif
    return;
  }
#ifdef DEBUG_GUI
//    Serial.printf("Doing the transfer of ROM image to PSRAM Image: \n");
#endif

  switch (Paint.Scale)
  {
    case 2:
      Addr = X / 8 + Y * Paint.WidthByte;
      Rdata = *(Paint.Image+Addr);
      if (Color & 0xff == ST7789_BLACK)
        *(Paint.Image+Addr) = Rdata & ~(0x80 >> (X % 8));
      else
        *(Paint.Image+Addr) = Rdata | (0x80 >> (X % 8));
    break;

    case 4:
      Addr = X / 4 + Y * Paint.WidthByte;
      Color = Color % 4; // Guaranteed color scale is 4  --- 0~3
      Rdata = *(Paint.Image+Addr);

      Rdata = Rdata & (~(0xC0 >> ((X % 4) * 2)));
      *(Paint.Image+Addr) = Rdata | ((Color << 6) >> ((X % 4) * 2));
    break;

    case 16:
      Addr = X / 2 + Y * Paint.WidthByte;
      Rdata = *(Paint.Image+Addr);
      Color = Color % 16;
      Rdata = Rdata & (~(0xf0 >> ((X % 2) * 4)));
      *(Paint.Image+Addr) = Rdata | ((Color << 4) >> ((X % 2) * 4));
    break;

    case 65:
      Addr = X * 2 + Y * Paint.WidthByte;
      *(Paint.Image+Addr) = 0xff & (Color>>8);
      *(Paint.Image+(++Addr)) = 0xff & Color;
    break;

    default:
#ifdef DEBUG_GUI
      Serial.println("Paint.Scale value is not 2,4,16 or 65 - Fail!");
#endif
    break;
  }
}

/******************************************************************************
function: Clear the color of the picture
parameter:
    Color : Painted colors
******************************************************************************/
bool Paint_Clear(uint16_t Color)
{
  uint32_t X = 0;

#ifdef DEBUG_GUI
  Serial.println("Entered Paint_Clear - ");
  Serial.printf("Paint.Image at      - 0x%x\n",Paint.Image);
  Serial.printf("Paint.Scale         - %i\n",Paint.Scale);
  Serial.printf("Paint.HeightByte    - %i\n",Paint.HeightByte);
  Serial.printf("Paint.WidthByte     - %i\n",Paint.WidthByte);
#endif

  switch (Paint.Scale)
    {
      case 2:
      case 4:
        for (X = 0; X < (Paint.HeightByte*Paint.WidthByte); X++ ) 
        {//8 pixel =  1 byte
          *(Paint.Image+X) = Color;
        }
      break;

      case 16:
        for (X = 0; X < (Paint.HeightByte*Paint.WidthByte); X++ ) 
        {//8 pixel =  1 byte
          Color = Color & 0x0f;
          *(Paint.Image+X) = (Color<<4) | Color;
        }
      break;

      case 65:
        for (X = 0; X < (Paint.HeightByte*Paint.WidthByte); X++ ) 
        {//8 pixel =  1 byte
          *(Paint.Image+X) = 0xff & (Color>>8);
          *(Paint.Image+(++X)) = 0xff & Color;
        }
      break;

      default:
#ifdef DEBUG_GUI
        Serial.println("Paint.Scale value is not 2,4,16 or 65 - Fail!");
#endif
        return true; // Scale value is not 2,4,16 or 65 - Fail!
      break;

