a-pemberton/ESP32-S3-Pico_Nixie_Clock/ESP32-S3_Nixie_Clock/GUI_Paint.cpp
  if (Xstart > Paint.Width || Ystart > Paint.Height) {
#ifdef DEBUG_GUI
    Serial.printf("Paint_DrawString_EN Input exceeds the normal display range\n");
#endif
    return;
  }

  while (* pString != '\0') {
//if X direction filled , reposition to(Xstart,Ypoint),Ypoint is Y direction plus the Height of the character
    if ((Xpoint + Font->Width ) > Paint.Width ) {
      Xpoint = Xstart;
      Ypoint += Font->Height;
    }

// If the Y direction is full, reposition to(Xstart, Ystart)
    if ((Ypoint  + Font->Height ) > Paint.Height ) {
      Xpoint = Xstart;
      Ypoint = Ystart;
    }
    Paint_DrawChar(Xpoint, Ypoint, * pString, Font, Color_Background, Color_Foreground);

//The next character of the address
    pString ++;

//The next word of the abscissa increases the font of the broadband
    Xpoint += Font->Width;
  }
}

/******************************************************************************
function: Display the Ideogram (Chinese) string
parameter:
    Xstart  ：X coordinate
    Ystart  ：Y coordinate
    pString ：The first address of the Chinese string and English
              string to be displayed
    Font    ：A structure pointer that displays a character size
    Color_Foreground : Select the foreground color
    Color_Background : Select the background color
******************************************************************************/
void Paint_DrawString_CN(uint16_t Xstart, uint16_t Ystart, const char * pString, cFONT* font, uint16_t Color_Foreground, uint16_t Color_Background)
{
  const char* p_text = pString;
  int x = Xstart, y = Ystart;
  int i, j,Num;

// Send the string character by character on LCD
  while (*p_text != 0) {
    if(*p_text <= 0x7F) {  //ASCII < 126
      for(Num = 0; Num < font->size; Num++) {
        if(*p_text== font->table[Num].index[0]) {
          const char* ptr = &font->table[Num].matrix[0];

        for (j = 0; j < font->Height; j++) {
          for (i = 0; i < font->Width; i++) {
            if (FONT_BACKGROUND == Color_Background) { //this process is to speed up the scan
              if (*ptr & (0x80 >> (i % 8))) {
                Paint_SetPixel(x + i, y + j, Color_Foreground);
                // Paint_DrawPoint(x + i, y + j, Color_Foreground, DOT_PIXEL_DFT, DOT_STYLE_DFT);
              }
            } else {
              if (*ptr & (0x80 >> (i % 8))) {
                Paint_SetPixel(x + i, y + j, Color_Foreground);
                // Paint_DrawPoint(x + i, y + j, Color_Foreground, DOT_PIXEL_DFT, DOT_STYLE_DFT);
              } else {
                Paint_SetPixel(x + i, y + j, Color_Background);
                // Paint_DrawPoint(x + i, y + j, Color_Background, DOT_PIXEL_DFT, DOT_STYLE_DFT);
              }
            }
            if (i % 8 == 7) ptr++;
          }
          if (font->Width % 8 != 0) ptr++;
        }
        break;
      }
    }
// Point on the next character
    p_text += 1;
// Decrement the column position by 16
    x += font->ASCII_Width;
    } else {        //Chinese
      for(Num = 0; Num < font->size; Num++) {
        if((*p_text== font->table[Num].index[0]) && (*(p_text+1) == font->table[Num].index[1])) {
          const char* ptr = &font->table[Num].matrix[0];

          for (j = 0; j < font->Height; j++) {
            for (i = 0; i < font->Width; i++) {
              if (FONT_BACKGROUND == Color_Background) { //this process is to speed up the scan
                if (*ptr & (0x80 >> (i % 8))) {
                  Paint_SetPixel(x + i, y + j, Color_Foreground);
                  // Paint_DrawPoint(x + i, y + j, Color_Foreground, DOT_PIXEL_DFT, DOT_STYLE_DFT);
                }
              } else {
                if (*ptr & (0x80 >> (i % 8))) {
                  Paint_SetPixel(x + i, y + j, Color_Foreground);
                  // Paint_DrawPoint(x + i, y + j, Color_Foreground, DOT_PIXEL_DFT, DOT_STYLE_DFT);
                } else {
                  Paint_SetPixel(x + i, y + j, Color_Background);
                  // Paint_DrawPoint(x + i, y + j, Color_Background, DOT_PIXEL_DFT, DOT_STYLE_DFT);
                }
              }
              if (i % 8 == 7) ptr++;
            }
            if (font->Width % 8 != 0) ptr++;
          }
          break;
        }
      }
// Point on the next character
      p_text += 2;
// Decrement the column position by 16
      x += font->Width;
    }
  }
}

/******************************************************************************
function:	Display nummber
parameter:
    Xstart           ：X coordinate
    Ystart           : Y coordinate
    Nummber          : The number displayed
    Font             ：A structure pointer that displays a character size
    Digit						 : Fractional width
    Color_Foreground : Select the foreground color
    Color_Background : Select the background color
******************************************************************************/
#define ARRAY_LEN 32
void Paint_DrawNum(uint16_t Xpoint, uint16_t Ypoint, double Nummber, sFONT *Font, uint16_t Digit, uint16_t Color_Foreground, uint16_t Color_Background)
{
  char Str[ARRAY_LEN];
  sprintf(Str, "%.*lf", Digit + 1, Nummber);
  *(Str + strlen(Str) - 1) = '\0';
  if (Digit == 0)
    *(Str + strlen(Str) - 1) = '\0';
// show
  Paint_DrawString_EN(Xpoint, Ypoint, (const char *)Str, Font, Color_Foreground, Color_Background);

}

/******************************************************************************
function:	Display time
parameter:
    Xstart           ：X coordinate
    Ystart           : Y coordinate
    pTime            : Time-related structures
    Font             ：A structure pointer that displays a character size
    Color_Foreground : Select the foreground color
    Color_Background : Select the background color
******************************************************************************/
void Paint_DrawTime(uint16_t Xstart, uint16_t Ystart, PAINT_TIME *pTime, sFONT* Font, uint16_t Color_Foreground, uint16_t Color_Background)
{
  uint8_t value[10] = {'0', '1', '2', '3', '4', '5', '6', '7', '8', '9'};

