a-pemberton/ESP32-S3-Pico_Nixie_Clock/ESP32-S3_Nixie_Clock/GUI_Paint.cpp
  uint16_t Dx = Font->Width;

//Write data into the cache
  Paint_DrawChar(Xstart                           , Ystart, value[pTime->Hour / 10], Font, Color_Background, Color_Foreground);
  Paint_DrawChar(Xstart + Dx                      , Ystart, value[pTime->Hour % 10], Font, Color_Background, Color_Foreground);
  Paint_DrawChar(Xstart + Dx  + Dx / 4 + Dx / 2   , Ystart, ':'                    , Font, Color_Background, Color_Foreground);
  Paint_DrawChar(Xstart + Dx * 2 + Dx / 2         , Ystart, value[pTime->Min / 10] , Font, Color_Background, Color_Foreground);
  Paint_DrawChar(Xstart + Dx * 3 + Dx / 2         , Ystart, value[pTime->Min % 10] , Font, Color_Background, Color_Foreground);
  Paint_DrawChar(Xstart + Dx * 4 + Dx / 2 - Dx / 4, Ystart, ':'                    , Font, Color_Background, Color_Foreground);
  Paint_DrawChar(Xstart + Dx * 5                  , Ystart, value[pTime->Sec / 10] , Font, Color_Background, Color_Foreground);
  Paint_DrawChar(Xstart + Dx * 6                  , Ystart, value[pTime->Sec % 10] , Font, Color_Background, Color_Foreground);
    
}

//******************************************************************************
// function: Paint_DrawImage
//    parameter:
//    Xpoint : At point X
//    Ypoint : At point Y
//    Color  : Painted colors
//    *sourceImage  : Pointer to start of image to be drawn - contents are unsigned char vis 8 bit
//    xStart  : Value of start point of the X axis of display, usually 0
//    yStart  : Value of start point of the Y axis of display, usually 0
//    W_Image : Maximum number of Pixel Points on the Width of the display
//    H_Image : Maximum number of Pixel Points on the Height of the display
//*******************************************************************************

void Paint_DrawImage(const uint8_t *sourceImage, uint16_t xStart, uint16_t yStart, uint16_t W_Image, uint16_t H_Image) 
{
#ifdef DEBUG_GUI
    Serial.printf("Entered Paint_DrawImage\n");
#endif
  int i,j; 
	for(j = 0; j < H_Image; j++) {
		for(i = 0; i < W_Image; i++) {
			if(xStart+i < Paint.WidthMemory  &&  yStart+j < Paint.HeightMemory) //Exceeded part does not display
				Paint_SetPixel(xStart + i, yStart + j, (*(sourceImage + j*W_Image*2 + i*2+1))<<8 | (*(sourceImage + j*W_Image*2 + i*2)));
				//Using arrays is a property of sequential storage, accessing the original array by algorithm
				//j*W_Image*2 			   Y offset
				//i*2              	   X offset
		}
	} 
#ifdef DEBUG_GUI
    Serial.printf("Finished Paint_DrawImage\n");
#endif
}

//******************************************************************************
// function: Paint_DrawImage_16bit
//    parameter:
//    Xpoint : At point X
//    Ypoint : At point Y
//    Color  : Painted colors
//    *sourceImage  : Pointer to start of image to be drawn
//    xStart  : Value of start point of the X axis of display, usually 0
//    yStart  : Value of start point of the Y axis of display, usually 0
//    W_Image : Maximum number of Pixel Points on the Width of the display
//    H_Image : Maximum number of Pixel Points on the Height of the display
//*******************************************************************************

void Paint_DrawImage_16bit(const uint16_t *sourceImage, uint16_t xStart, uint16_t yStart, uint16_t W_Image, uint16_t H_Image) 
{
  int i,j; 
	for(j = 0; j < H_Image; j++){
		for(i = 0; i < W_Image; i++){
			if(((xStart+i) < Paint.WidthMemory)  &&  ((yStart+j) < Paint.HeightMemory))  //Exceeded part does not display
				Paint_SetPixel((xStart+W_Image) - i, yStart + j, (*(sourceImage + (i*H_Image) + j)));
		}
	} 
}

// Paints image turned if LCD is rotated 90 degrees (e.g.Landscape) 8 bit data only
void Paint_DrawImage1(const unsigned char *sourceImage, uint16_t xStart, uint16_t yStart, uint16_t W_Image, uint16_t H_Image)
{
  int i, j;
  for (j = 0; j < H_Image; j++) {
    for (i = 0; i < W_Image; i++) {
      if (xStart + i < Paint.HeightMemory && yStart + j < Paint.WidthMemory) // Exceeded part does not display
        Paint_SetPixel(xStart + i, yStart + j, (*(sourceImage + j * W_Image * 2 + i * 2 + 1)) << 8 | (*(sourceImage + j * W_Image * 2 + i * 2)));
        // Using arrays is a property of sequential storage, accessing the original array by algorithm
        // j*W_Image*2 			   Y offset
        // i*2              	   X offset
    }
  }
}

/******************************************************************************
function:	Display monochrome bitmap
parameter:
    image_buffer ：A picture data converted to a bitmap
info:
    Use a computer to convert the image into a corresponding array,
    and then embed the array directly into Imagedata.cpp as a .c file.
******************************************************************************/
void Paint_DrawBitMap(const unsigned char *image_buffer)
{
  uint16_t x, y;
  uint32_t Addr = 0;

  for (y = 0; y < Paint.HeightByte; y++) {
    for (x = 0; x < Paint.WidthByte; x++) {//8 pixel =  1 byte
      Addr = x + y * Paint.WidthByte;
      Paint.Image[Addr] = (unsigned char)image_buffer[Addr];
    }
  }
}

void Paint_DrawBitMap_Block(const unsigned char* image_buffer, uint8_t Region)
{
  uint16_t x, y;
  uint32_t Addr = 0;
	for (y = 0; y < Paint.HeightByte; y++) {
		for (x = 0; x < Paint.WidthByte; x++) {//8 pixel =  1 byte
			Addr = x + y * Paint.WidthByte ;
			Paint.Image[Addr] = \
			(unsigned char)image_buffer[Addr+ (Paint.HeightByte)*Paint.WidthByte*(Region - 1)];
		}
	}
}

void Paint_BmpWindows(unsigned char x,unsigned char y,const unsigned char *pBmp, unsigned char chWidth,unsigned char chHeight)
{
	uint16_t i, j, byteWidth = (chWidth + 7)/8;
  for(j = 0; j < chHeight; j ++) {
    for(i = 0; i < chWidth; i ++ ) {
      if(*(pBmp + j * byteWidth + i / 8) & (128 >> (i & 7)))
        Paint_SetPixel(x+i, y+j, 0xffff);
    }
  }
}
         
